--------------------------------------------------------------------------------
-- Получить список всех категорий (Идентификатор, Наименование категории);
SELECT
id AS "Идентификатор",
label AS "Наименование категории"
FROM categories
--------------------------------------------------------------------------------
-- Получить список категорий для которых создана минимум одна публикация
-- Идентификатор, Наименование категории);
SELECT
c.id AS "Идентификатор",
c.label AS "Наименование категории"
FROM categories c
JOIN articles_categories ac
ON c.id = ac.category_id
GROUP BY c.id
ORDER BY c.id;
--------------------------------------------------------------------------------
-- Получить список категорий с количеством публикаций (Идентификатор,
-- Наименование категории, Количество публикаций в категории);
SELECT
c.id AS "Идентификатор",
c.label AS "Наименование категории",
COUNT(ac.article_id) AS "Количество публикаций в категории"
FROM categories c
LEFT JOIN articles_categories ac
ON c.id = ac.category_id
GROUP BY c.id
ORDER BY c.id;
--------------------------------------------------------------------------------
-- Получить список публикаций (Идентификатор публикации, Заголовок публикации,
-- Анонс публикации, Дата публикации, Имя и фамилия автора, Контактный email,
-- Количество комментариев, Наименование категорий). Сначала свежие публикации;
SELECT
a.id AS "Идентификатор публикации",
a.title AS "Заголовок публикации",
a.announce AS "Анонс публикации",
a.created_date AS "Дата публикации",
u.name AS "Имя и фамилия автора",
COUNT(c) AS "Количество комментариев",
(STRING_AGG(ca.label, ',')) AS "Наименование категорий"
FROM articles a
JOIN users u ON u.id = 1
LEFT JOIN comments c ON c.article_id = a.id
LEFT JOIN articles_categories aca ON a.id = aca.article_id
LEFT JOIN categories ca ON ca.id = aca.category_id
GROUP BY a.id, u.name
ORDER BY a.created_date DESC;
--------------------------------------------------------------------------------
-- Получить полную информацию определённой публикации (Идентификатор публикации,
-- Заголовок публикации, Анонс, Полный текст публикации, Дата публикации, Путь к
-- изображению, Имя и фамилия автора, Контактный email, Количество комментариев,
-- Наименование категорий);
SELECT
a.id AS "Идентификатор публикации",
a.title AS "Заголовок публикации",
a.announce AS "Анонс публикации",
a.created_date AS "Дата публикации",
a.img AS "Путь к изображению",
u.name AS "Имя и фамилия автора",
COUNT(c) AS "Количество комментариев",
(STRING_AGG(ca.label, ',')) AS "Наименование категорий"
FROM articles a
JOIN users u ON u.id = 1
JOIN comments c ON c.article_id = a.id
JOIN articles_categories aca ON a.id = aca.article_id
JOIN categories ca ON ca.id = aca.category_id
WHERE a.id = 3
GROUP BY a.id, u.name;
--------------------------------------------------------------------------------
-- Получить список из 5 свежих комментариев (Идентификатор комментария,
-- Идентификатор публикации, Имя и фамилия автора, Текст комментария);
SELECT
c.id AS "Идентификатор комментария",
a.id AS "Идентификатор публикации",
u.name AS "Имя и фамилия автора",
c.comment AS "Текст комментария",
c.created_date AS "ДАТА"
FROM comments c
JOIN users u ON u.id = c.user_id
JOIN articles a ON a.id = c.article_id
ORDER BY c.created_date DESC
LIMIT 5;
--------------------------------------------------------------------------------
-- Получить список комментариев для определённой публикации (Идентификатор
-- комментария, Идентификатор публикации, Имя и фамилия автора, Текст
-- комментария). Сначала новые комментарии;
SELECT
c.id AS "Идентификатор комментария",
a.id AS "Идентификатор публикации",
u.name AS "Имя и фамилия автора",
c.comment AS "Текст комментария"
FROM comments c
JOIN users u ON u.id = c.user_id
JOIN articles a ON a.id = c.article_id
WHERE a.id = 3
ORDER BY c.created_date DESC;
--------------------------------------------------------------------------------
-- Обновить заголовок определённой публикации на «Как я встретил Новый год»;
UPDATE articles
SET title = 'Как я встретил Новый год'
WHERE id = 2;
--------------------------------------------------------------------------------
