--------------------------------------------------------------------------------
-- Получить список всех категорий (Идентификатор, Наименование категории);
SELECT
id AS "Идентификатор",
label AS "Наименование категории"
FROM t_category
--------------------------------------------------------------------------------
-- Получить список категорий для которых создана минимум одна публикация
-- Идентификатор, Наименование категории);
SELECT
c.id AS "Идентификатор",
c.label AS "Наименование категории"
FROM t_category c
JOIN t_article_t_category ac
ON c.id = ac.article_category_fk_category_id
GROUP BY c.id
ORDER BY c.id;
--------------------------------------------------------------------------------
-- Получить список категорий с количеством публикаций (Идентификатор,
-- Наименование категории, Количество публикаций в категории);
SELECT
c.id AS "Идентификатор",
c.label AS "Наименование категории",
COUNT(ac.article_category_fk_article_id) AS "Количество публикаций в категории"
FROM t_category c
LEFT JOIN t_article_t_category ac
ON c.id = ac.article_category_fk_category_id
GROUP BY c.id
ORDER BY c.id;
--------------------------------------------------------------------------------
-- Получить список публикаций (Идентификатор публикации, Заголовок публикации,
-- Анонс публикации, Дата публикации, Имя и фамилия автора, Контактный email,
-- Количество комментариев, Наименование категорий). Сначала свежие публикации;
SELECT
a.id AS "Идентификатор публикации",
a.title AS "Заголовок публикации",
a.announce AS "Анонс публикации",
a.created_date AS "Дата публикации",
u.name AS "Имя и фамилия автора",
COUNT(c) AS "Количество комментариев",
(STRING_AGG(ca.label, ',')) AS "Наименование категорий"
FROM t_article a
JOIN t_user u ON u.id = 1
LEFT JOIN t_comment c ON c.comment_fk_t_article_id = a.id
LEFT JOIN t_article_t_category aca ON a.id = aca.article_category_fk_article_id
LEFT JOIN t_category ca ON ca.id = aca.article_category_fk_category_id
GROUP BY a.id, u.name
ORDER BY a.created_date DESC;
--------------------------------------------------------------------------------
-- Получить полную информацию определённой публикации (Идентификатор публикации,
-- Заголовок публикации, Анонс, Полный текст публикации, Дата публикации, Путь к
-- изображению, Имя и фамилия автора, Контактный email, Количество комментариев,
-- Наименование категорий);
SELECT
a.id AS "Идентификатор публикации",
a.title AS "Заголовок публикации",
a.announce AS "Анонс публикации",
a.created_date AS "Дата публикации",
a.img AS "Путь к изображению",
u.name AS "Имя и фамилия автора",
COUNT(c) AS "Количество комментариев",
(STRING_AGG(ca.label, ',')) AS "Наименование категорий"
FROM t_article a
JOIN t_user u ON u.id = 1
JOIN t_comment c ON c.comment_fk_t_article_id = a.id
JOIN t_article_t_category aca ON a.id = aca.article_category_fk_article_id
JOIN t_category ca ON ca.id = aca.article_category_fk_category_id
WHERE a.id = 3
GROUP BY a.id, u.name;
--------------------------------------------------------------------------------
-- Получить список из 5 свежих комментариев (Идентификатор комментария,
-- Идентификатор публикации, Имя и фамилия автора, Текст комментария);
SELECT
c.id AS "Идентификатор комментария",
a.id AS "Идентификатор публикации",
u.name AS "Имя и фамилия автора",
c.comment AS "Текст комментария",
c.created_date AS "ДАТА"
FROM t_comment c
JOIN t_user u ON u.id = c.comment_fk_t_user_id
JOIN t_article a ON a.id = c.comment_fk_t_article_id
ORDER BY c.created_date DESC
LIMIT 5;
--------------------------------------------------------------------------------
-- Получить список комментариев для определённой публикации (Идентификатор
-- комментария, Идентификатор публикации, Имя и фамилия автора, Текст
-- комментария). Сначала новые комментарии;
-- Получить список комментариев для определённой публикации (Идентификатор
-- комментария, Идентификатор публикации, Имя и фамилия автора, Текст
-- комментария). Сначала новые комментарии;
SELECT
c.id AS "Идентификатор комментария",
a.id AS "Идентификатор публикации",
u.name AS "Имя и фамилия автора",
c.comment AS "Текст комментария"
FROM t_comment c
JOIN t_user u ON u.id = c.comment_fk_t_user_id
JOIN t_article a ON a.id = c.comment_fk_t_article_id
WHERE a.id = 2
ORDER BY c.created_date DESC;
--------------------------------------------------------------------------------
-- Обновить заголовок определённой публикации на «Как я встретил Новый год»;
UPDATE t_article
SET title = 'Как я встретил Новый год'
WHERE id = 2;
--------------------------------------------------------------------------------
